import { CrosserData } from "./types"

export const greek_7x7_20240108: CrosserData = {
	size: [7, 7],
	spots: {
		1: { row: 0, col: 0 },
		2: { row: 0, col: 2 },
		3: { row: 0, col: 4 },
		4: { row: 0, col: 6 },
		5: { row: 2, col: 0 },
		6: { row: 4, col: 0 },
		7: { row: 6, col: 0 },
	},
	across: {
		1: { clue: "... Ντες: κρατος της Ν. Ασιας με πρωευουσα τη Ντακα.", answer: "μπαγκλα" },
		5: { clue: "Το ανεξοδο, ποθ δεν απαιτει δαπανη.", answer: "αδαπανο" },
		6: { clue: "<< Οποιος σπερνει ... συγκομιζει μισος>>: γνωστη παροιμια.", answer: "αδικιες" },
		7: {
			clue: "<<...μετρας>>: τραγουδι του Γιωργου Χατζηνασιου με τη Μαρινελλα.",
			answer: "αναποδα",
		},
	},
	down: {
		1: { clue: "Ειδος τροπικου φρουτου που ευδοκιμει και στην Κρητη.", answer: "μπανανα" },
		2: {
			clue: "Παλιο βραχυκαννο πυροβολο οπλο του ιππικου και του πυροβολικου.",
			answer: "αραβιδα",
		},
		3: { clue: "Το σχετικο με τους επαγγελματικους κλαδους.", answer: "κλαδικο" },
		4: { clue: "Τα χωρις γουστο, ακομψα.", answer: "αγουστα" },
	},
}
